# BuiltInFailures.CurveByPointFailures Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..CurveByPointFailures Properties
BuiltInFailures..::..CurveByPointFailures Class See Also
---
The BuiltInFailures..::..CurveByPointFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| UnableToGenerateCurve | Unable to generate valid curve geometry from the driving points. The line by points will be dissolved. |

# See Also
BuiltInFailures..::..CurveByPointFailures Class
Autodesk.Revit.DB Namespace